In [1]:
import numpy as np

In [2]:
import pandas as pd
import os

In [5]:
df = pd.read_csv('example1.csv')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_csv('sooraj.csv',index=False)

In [8]:
os.getcwd()

'C:\\Users\\prade\\3D Objects\\Complete-Python-3-Beat Educations Bootcamp-master\\Complete-Python-3-Beat Educations Bootcamp-master\\20-Numpy , Pandas and Visualization\\03-Python-for-Data-Analysis-Pandas'

In [9]:
df=pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [10]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [13]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [17]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [18]:
import sqlite3

In [19]:
sooraj= sqlite3.connect('geek.db')

In [20]:
sooraj

In [21]:
os.getcwd()

'C:\\Users\\prade\\3D Objects\\Complete-Python-3-Beat Educations Bootcamp-master\\Complete-Python-3-Beat Educations Bootcamp-master\\20-Numpy , Pandas and Visualization\\03-Python-for-Data-Analysis-Pandas'

In [23]:
cursor1=sooraj.cursor()

In [24]:
cursor1

In [25]:
table = """ CREATE TABLE GEEK (
            Email VARCHAR(255) NOT NULL,
            First_Name CHAR(25) NOT NULL,
            Last_Name CHAR(25),
            Score INT
        ); """

In [29]:
cursor1.execute(table)